## Clean data

Part of the cleaning was done in spreadsheet software. It was just more convenient.

## 1. Importing all packages

In [1]:
# External
import pandas as pd

## 2. Euro rates

### 2.1 Importing  a CSV file

In [2]:
file_name = "euro_rates_04_14_2023.csv"
df = pd.read_csv(f"data\RAW\_Socioeconomic data\{file_name}")
df.head()

,Date,USD,JPY,BGN,CYP,CZK,DKK,EEK,GBP,HUF,...,INR,KRW,MXN,MYR,NZD,PHP,SGD,THB,ZAR,Unnamed: 42
0,2023-04-20,1.0944,147.46,1.9558,NaN,23.502,7.4524,NaN,0.88153,377.68,...,89.9365,1450.34,19.8156,4.8564,1.7763,61.429,1.4599,37.609,19.8552,NaN
1,2023-04-19,1.0933,147.24,1.9558,NaN,23.475,7.4514,NaN,0.88108,376.35,...,89.8985,1458.87,19.8057,4.8564,1.7668,61.709,1.4615,37.708,19.9808,NaN
2,2023-04-18,1.0972,146.89,1.9558,NaN,23.373,7.4513,NaN,0.88143,371.68,...,89.9955,1445.35,19.7174,4.8650,1.7637,61.730,1.4614,37.623,19.9299,NaN
3,2023-04-17,1.0981,146.97,1.9558,NaN,23.345,7.4520,NaN,0.88373,371.70,...,90.0607,1444.13,19.7526,4.8558,1.7717,61.449,1.4615,37.753,19.8937,NaN
4,2023-04-14,1.1057,146.60,1.9558,NaN,23.341,7.4510,NaN,0.88440,373.68,...,90.3595,1438.43,19.9598,4.8673,1.7588,61.122,1.4665,37.660,19.9352,NaN

In [3]:
filtered_df = df[df["Date"].str.contains("2023-04-14")]
df = filtered_df
df

,Date,USD,JPY,BGN,CYP,CZK,DKK,EEK,GBP,HUF,...,INR,KRW,MXN,MYR,NZD,PHP,SGD,THB,ZAR,Unnamed: 42
4,2023-04-14,1.1057,146.6,1.9558,NaN,23.341,7.451,NaN,0.8844,373.68,...,90.3595,1438.43,19.9598,4.8673,1.7588,61.122,1.4665,37.66,19.9352,NaN

In [4]:
df.columns

Index(['Date', 'USD', 'JPY', 'BGN', 'CYP', 'CZK', 'DKK', 'EEK', 'GBP', 'HUF',
       'LTL', 'LVL', 'MTL', 'PLN', 'ROL', 'RON', 'SEK', 'SIT', 'SKK', 'CHF',
       'ISK', 'NOK', 'HRK', 'RUB', 'TRL', 'TRY', 'AUD', 'BRL', 'CAD', 'CNY',
       'HKD', 'IDR', 'ILS', 'INR', 'KRW', 'MXN', 'MYR', 'NZD', 'PHP', 'SGD',
       'THB', 'ZAR', 'Unnamed: 42'],
      dtype='object')

In [5]:
df.drop('Date', axis=1, inplace=True)

In [6]:
df.shape

(1, 42)

### 2.2 Reshape

In [7]:
filtered_df = pd.melt(
    df,
    var_name='Currency',
    value_name='Rate',
    ignore_index=True
)

filtered_df

df = filtered_df

df.set_index('Currency', inplace=True)

df.shape

(42, 1)

In [8]:
df

                   Rate
Currency
USD              1.1057
JPY            146.6000
BGN              1.9558
CYP                 NaN
CZK             23.3410
DKK              7.4510
EEK                 NaN
GBP              0.8844
HUF            373.6800
LTL                 NaN
LVL                 NaN
MTL                 NaN
PLN              4.6435
ROL                 NaN
RON              4.9423
SEK             11.3455
SIT                 NaN
SKK                 NaN
CHF              0.9827
ISK            149.7000
NOK             11.4020
HRK                 NaN
RUB                 NaN
TRL                 NaN
TRY             21.4218
AUD              1.6309
BRL              5.4410
CAD              1.4725
CNY              7.5761
HKD              8.6797
IDR          16291.7900
ILS              4.0426
INR             90.3595
KRW           1438.4300
MXN             19.9598
MYR              4.8673
NZD              1.7588
PHP             61.1220
SGD              1.4665
THB             37.6600
ZAR             19.9352
Unnamed: 42         NaN

### 2.2 Remove duplicates

In [9]:
df = df.drop_duplicates()
df.shape

(31, 1)

### 2.3 Remove NaNs

In [10]:
df.dropna(how="all", axis=0, inplace=True)
df.dropna(how="all", axis=1, inplace=True)
df

C:\Users\karol\AppData\Local\Temp\ipykernel_20348\3309432457.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.dropna(how="all", axis=0, inplace=True)
C:\Users\karol\AppData\Local\Temp\ipykernel_20348\3309432457.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.dropna(how="all", axis=1, inplace=True)

                Rate
Currency
USD           1.1057
JPY         146.6000
BGN           1.9558
CZK          23.3410
DKK           7.4510
GBP           0.8844
HUF         373.6800
PLN           4.6435
RON           4.9423
SEK          11.3455
CHF           0.9827
ISK         149.7000
NOK          11.4020
TRY          21.4218
AUD           1.6309
BRL           5.4410
CAD           1.4725
CNY           7.5761
HKD           8.6797
IDR       16291.7900
ILS           4.0426
INR          90.3595
KRW        1438.4300
MXN          19.9598
MYR           4.8673
NZD           1.7588
PHP          61.1220
SGD           1.4665
THB          37.6600
ZAR          19.9352

### 2.4 Convert EURO rate to USD

In [11]:
USD_to_EUR = 1 / df.loc['USD']['Rate']

usd_rates = pd.DataFrame(df['Rate'] / df.loc['USD']['Rate'])
usd_rates

                  Rate
Currency
USD           1.000000
JPY         132.585692
BGN           1.768834
CZK          21.109704
DKK           6.738718
GBP           0.799855
HUF         337.957855
PLN           4.199602
RON           4.469838
SEK          10.260921
CHF           0.888758
ISK         135.389346
NOK          10.312020
TRY          19.373971
AUD           1.474993
BRL           4.920865
CAD           1.331736
CNY           6.851859
HKD           7.849959
IDR       14734.367369
ILS           3.656145
INR          81.721534
KRW        1300.922493
MXN          18.051732
MYR           4.402008
NZD           1.590667
PHP          55.279009
SGD           1.326309
THB          34.059872
ZAR          18.029484

In [12]:
EUR = pd.DataFrame({'Rate': USD_to_EUR}, index=['EUR']).rename_axis('Currency')
EUR.head()

              Rate
Currency
EUR       0.904404

In [13]:

usd_rates = pd.concat([usd_rates, EUR], axis=0)
usd_rates

df = usd_rates
df

                  Rate
Currency
USD           1.000000
JPY         132.585692
BGN           1.768834
CZK          21.109704
DKK           6.738718
GBP           0.799855
HUF         337.957855
PLN           4.199602
RON           4.469838
SEK          10.260921
CHF           0.888758
ISK         135.389346
NOK          10.312020
TRY          19.373971
AUD           1.474993
BRL           4.920865
CAD           1.331736
CNY           6.851859
HKD           7.849959
IDR       14734.367369
ILS           3.656145
INR          81.721534
KRW        1300.922493
MXN          18.051732
MYR           4.402008
NZD           1.590667
PHP          55.279009
SGD           1.326309
THB          34.059872
ZAR          18.029484
EUR           0.904404

In [14]:
del USD_to_EUR, usd_rates, EUR

### 2.5 Sort currencies

In [15]:
df.sort_index(inplace=True)
df

                  Rate
Currency
AUD           1.474993
BGN           1.768834
BRL           4.920865
CAD           1.331736
CHF           0.888758
CNY           6.851859
CZK          21.109704
DKK           6.738718
EUR           0.904404
GBP           0.799855
HKD           7.849959
HUF         337.957855
IDR       14734.367369
ILS           3.656145
INR          81.721534
ISK         135.389346
JPY         132.585692
KRW        1300.922493
MXN          18.051732
MYR           4.402008
NOK          10.312020
NZD           1.590667
PHP          55.279009
PLN           4.199602
RON           4.469838
SEK          10.260921
SGD           1.326309
THB          34.059872
TRY          19.373971
USD           1.000000
ZAR          18.029484

### 2.5 Save CSV

##### 2.5.1 Save

In [16]:
file_name = "dollar_rates_04_14_2023.csv"
file_to_save = f"data\clean\_Socioeconomic data\{file_name}"
df.to_csv(file_to_save, index=True)

##### 2.5.2 Check save

In [17]:
df_check = pd.read_csv(file_to_save, index_col=0)

In [18]:
df_check.shape == df.shape

True

In [19]:
del df_check, file_to_save, df

## 3. Averages salaries (To parse odd values)

The OECD didn't have: Hong Kong, Taiwan, Singapore, Romania data. So there were added manually to the raw file.

In [20]:
file_name = "AVG_Salaries.csv"
df = pd.read_csv(f"data\RAW\_Socioeconomic data\{file_name}")
df.head()

  LOCATION INDICATOR SUBJECT MEASURE FREQUENCY  TIME         Value  Flag Codes
0      AUS    AVWAGE     TOT     USD         A  2018  54585.736152         NaN
1      AUS    AVWAGE     TOT     USD         A  2019  55170.159357         NaN
2      AUS    AVWAGE     TOT     USD         A  2020  56454.642688         NaN
3      AUS    AVWAGE     TOT     USD         A  2021  56599.929986         NaN
4      AUT    AVWAGE     TOT     USD         A  2018  56738.962428         NaN

### 3.1 Drop unnecessary columns

In [21]:
[df['MEASURE'].unique(), df['INDICATOR'].unique(), df['SUBJECT'].unique(), df['FREQUENCY'].unique(), df['Flag Codes'].unique(),]

[array(['USD'], dtype=object),
 array(['AVWAGE', 'MDWAGE'], dtype=object),
 array(['TOT'], dtype=object),
 array(['A'], dtype=object),
 array([nan])]

In [22]:
df.drop(columns=['MEASURE', 'INDICATOR', 'SUBJECT', 'FREQUENCY', 'Flag Codes'], axis=1, inplace=True)
df

    LOCATION  TIME         Value
0        AUS  2018  54585.736152
1        AUS  2019  55170.159357
2        AUS  2020  56454.642688
3        AUS  2021  56599.929986
4        AUT  2018  56738.962428
..       ...   ...           ...
142      TUR  2020  32482.671310
143      ROU  2023  25848.000000
144      HKG  2023  28704.000000
145      TWN  2023  55620.000000
146      SGP  2023  60840.000000

[147 rows x 3 columns]

### 3.2 Leave last year

In [23]:
def filter_max_year(df: pd.DataFrame, location_col='LOCATION', year_col='TIME', value_col='Value'):

    max_years = df.groupby(location_col)[year_col].transform("max")

    filtered_df = df[df[year_col] == max_years].reset_index(drop=True)

    filtered_df.rename(columns={'Value': value_col}, inplace=True)

    return filtered_df

df = filter_max_year(df)
df

   LOCATION  TIME         Value
0       AUS  2021  56599.929986
1       AUT  2021  58189.134687
2       BEL  2021  59100.180937
3       CAN  2021  56005.617136
4       CZE  2021  31710.896864
5       DNK  2021  61330.771342
6       FIN  2021  49707.629098
7       FRA  2021  49312.581482
8       DEU  2021  56040.216147
9       GRC  2021  25743.507304
10      HUN  2021  26268.036934
11      IRL  2021  51045.078712
12      ITA  2021  40767.203814
13      JPN  2021  39711.429745
14      KOR  2021  42747.109460
15      LUX  2021  73656.794473
16      MEX  2021  16429.263589
17      NLD  2021  60922.604657
18      NOR  2021  58377.006567
19      POL  2021  33566.278945
20      PRT  2021  29740.295432
21      SVK  2021  24804.671140
22      ESP  2021  39202.301063
23      SWE  2021  48951.102666
24      CHE  2021  68957.452684
25      GBR  2021  49979.255684
26      USA  2021  74737.845354
27      EST  2021  33188.116299
28      ISR  2021  42164.806114
29      SVN  2021  43892.425404
30     OECD  2021  51606.868818
31      ISL  2021  72047.358970
32      NZL  2021  46976.387100
33      LVA  2021  32235.409373
34      LTU  2021  42027.315916
35      TUR  2020  32482.671310
36      ROU  2023  25848.000000
37      HKG  2023  28704.000000
38      TWN  2023  55620.000000
39      SGP  2023  60840.000000

### 3.3 Remove year

In [24]:
df.drop(columns=['TIME'], axis=1, inplace=True)
df.head()

  LOCATION         Value
0      AUS  56599.929986
1      AUT  58189.134687
2      BEL  59100.180937
3      CAN  56005.617136
4      CZE  31710.896864

### 3.4 Create poverty line (per month)

We do not have median, but we can take into account that it is similar to average (usually a bit lower than median).
In our case it would 50% of the average salary in selected country.

In [25]:
df['Value'] = df['Value'].apply(lambda x: int((x / 2) / 12))
df

   LOCATION  Value
0       AUS   2358
1       AUT   2424
2       BEL   2462
3       CAN   2333
4       CZE   1321
5       DNK   2555
6       FIN   2071
7       FRA   2054
8       DEU   2335
9       GRC   1072
10      HUN   1094
11      IRL   2126
12      ITA   1698
13      JPN   1654
14      KOR   1781
15      LUX   3069
16      MEX    684
17      NLD   2538
18      NOR   2432
19      POL   1398
20      PRT   1239
21      SVK   1033
22      ESP   1633
23      SWE   2039
24      CHE   2873
25      GBR   2082
26      USA   3114
27      EST   1382
28      ISR   1756
29      SVN   1828
30     OECD   2150
31      ISL   3001
32      NZL   1957
33      LVA   1343
34      LTU   1751
35      TUR   1353
36      ROU   1077
37      HKG   1196
38      TWN   2317
39      SGP   2535

### 3.5 Rename Value

In [26]:
df.rename(columns={"Value": "USD"}, inplace=True)
df.columns

Index(['LOCATION', 'USD'], dtype='object')

### 3.6 Codes to countries

In [27]:

file_name = "country-codes.csv"
file_path = f"data\RAW\_Socioeconomic data\{file_name}"
pd.read_csv(file_path).head()

             name alpha-3  country-code
0     Afghanistan     AFG             4
1   Ã…land Islands     ALA           248
2         Albania     ALB             8
3         Algeria     DZA            12
4  American Samoa     ASM            16

In [28]:
df_alpha3 = pd.read_csv(file_path)
df_alpha3.drop(columns=['country-code'], axis=1, inplace=True)
df_alpha3.rename(columns={'alpha-3': 'LOCATION'}, inplace=True)
df_alpha3.head()

             name LOCATION
0     Afghanistan      AFG
1   Ã…land Islands      ALA
2         Albania      ALB
3         Algeria      DZA
4  American Samoa      ASM

In [29]:
df_merged = df.merge(df_alpha3, on='LOCATION')
df_merged

   LOCATION   USD                                               name
0       AUS  2358                                          Australia
1       AUT  2424                                            Austria
2       BEL  2462                                            Belgium
3       CAN  2333                                             Canada
4       CZE  1321                                            Czechia
5       DNK  2555                                            Denmark
6       FIN  2071                                            Finland
7       FRA  2054                                             France
8       DEU  2335                                            Germany
9       GRC  1072                                             Greece
10      HUN  1094                                            Hungary
11      IRL  2126                                            Ireland
12      ITA  1698                                              Italy
13      JPN  1654                                              Japan
14      KOR  1781                                 Korea, Republic of
15      LUX  3069                                         Luxembourg
16      MEX   684                                             Mexico
17      NLD  2538                                        Netherlands
18      NOR  2432                                             Norway
19      POL  1398                                             Poland
20      PRT  1239                                           Portugal
21      SVK  1033                                           Slovakia
22      ESP  1633                                              Spain
23      SWE  2039                                             Sweden
24      CHE  2873                                        Switzerland
25      GBR  2082  United Kingdom of Great Britain and Northern I...
26      USA  3114                           United States of America
27      EST  1382                                            Estonia
28      ISR  1756                                             Israel
29      SVN  1828                                           Slovenia
30      ISL  3001                                            Iceland
31      NZL  1957                                        New Zealand
32      LVA  1343                                             Latvia
33      LTU  1751                                          Lithuania
34      TUR  1353                                             Turkey
35      ROU  1077                                            Romania
36      HKG  1196                                          Hong Kong
37      TWN  2317                          Taiwan, Province of China
38      SGP  2535                                          Singapore

In [30]:
df_merged.set_index('LOCATION', inplace=True)

In [31]:
df_merged.loc['GBR', 'name'] = "United_Kingdom"
df_merged.loc['USA', 'name'] = "United_States"
df_merged.loc['KOR', 'name'] = "South_Korea"
df_merged.loc['CZE', 'name'] = "Czech_Republic"
df_merged.loc['HKG', 'name'] = "Hong_Kong"
df_merged.loc['TWN', 'name'] = "Taiwan"

In [32]:
df_merged['name'] = df_merged['name'].apply(lambda x: x.replace(" ", "_"))

In [33]:
df_merged

           USD            name
LOCATION
AUS       2358       Australia
AUT       2424         Austria
BEL       2462         Belgium
CAN       2333          Canada
CZE       1321  Czech_Republic
DNK       2555         Denmark
FIN       2071         Finland
FRA       2054          France
DEU       2335         Germany
GRC       1072          Greece
HUN       1094         Hungary
IRL       2126         Ireland
ITA       1698           Italy
JPN       1654           Japan
KOR       1781     South_Korea
LUX       3069      Luxembourg
MEX        684          Mexico
NLD       2538     Netherlands
NOR       2432          Norway
POL       1398          Poland
PRT       1239        Portugal
SVK       1033        Slovakia
ESP       1633           Spain
SWE       2039          Sweden
CHE       2873     Switzerland
GBR       2082  United_Kingdom
USA       3114   United_States
EST       1382         Estonia
ISR       1756          Israel
SVN       1828        Slovenia
ISL       3001         Iceland
NZL       1957     New_Zealand
LVA       1343          Latvia
LTU       1751       Lithuania
TUR       1353          Turkey
ROU       1077         Romania
HKG       1196       Hong_Kong
TWN       2317          Taiwan
SGP       2535       Singapore

In [34]:
df_merged = df_merged.reset_index(drop=True)
df_merged.rename(columns={'name': 'LOCATION'}, inplace=True)
df_merged

     USD        LOCATION
0   2358       Australia
1   2424         Austria
2   2462         Belgium
3   2333          Canada
4   1321  Czech_Republic
5   2555         Denmark
6   2071         Finland
7   2054          France
8   2335         Germany
9   1072          Greece
10  1094         Hungary
11  2126         Ireland
12  1698           Italy
13  1654           Japan
14  1781     South_Korea
15  3069      Luxembourg
16   684          Mexico
17  2538     Netherlands
18  2432          Norway
19  1398          Poland
20  1239        Portugal
21  1033        Slovakia
22  1633           Spain
23  2039          Sweden
24  2873     Switzerland
25  2082  United_Kingdom
26  3114   United_States
27  1382         Estonia
28  1756          Israel
29  1828        Slovenia
30  3001         Iceland
31  1957     New_Zealand
32  1343          Latvia
33  1751       Lithuania
34  1353          Turkey
35  1077         Romania
36  1196       Hong_Kong
37  2317          Taiwan
38  2535       Singapore

In [35]:
df_merged.set_index("LOCATION", inplace = True)
df_merged.head()

                 USD
LOCATION
Australia       2358
Austria         2424
Belgium         2462
Canada          2333
Czech_Republic  1321

### 3.4 Save

In [36]:
file_name = "OECD_poverty_line_monthly.csv"
file_path = f"data\clean\_Socioeconomic data\{file_name}"
df_merged.to_csv(file_path, index=True)

In [37]:
pd.read_csv(file_path).head()

         LOCATION   USD
0       Australia  2358
1         Austria  2424
2         Belgium  2462
3          Canada  2333
4  Czech_Republic  1321

## 4. Purchasing Power Parities

### 4.1 Importing a CSV file

In [ ]:
df = pd.read_csv("data\RAW\_Socioeconomic data\DP_LIVE_04042023094701143.csv")
df.head()

In [ ]:
df.shape

### 4.2 Filter max year for each country

In [ ]:
def filter_max_year(df: pd.DataFrame, location_col='LOCATION', year_col='TIME', value_col='Value'):

    max_years = df.groupby(location_col)[year_col].transform("max")

    filtered_df = df[df[year_col] == max_years].reset_index(drop=True)

    filtered_df.rename(columns={'Value': value_col}, inplace=True)

    return filtered_df

df = filter_max_year(df)
df

### 4.3 Rename columns

In [ ]:
df.columns = ['Country', 'Year', 'Conversion']
df.set_index('Country', inplace=True)
df.head()

### 4.4 Remove duplicates

In [ ]:
df.shape

In [ ]:
df = df.dropna(how="all")
df.shape

### 4.5 Remove NaNs

In [ ]:
df = df.dropna(how="all")
df.shape

### 4.6 Preview

In [ ]:
df

### 4.7 Save CSV

#### 4.7.1 Save

In [ ]:
file_to_save = "data\clean\_Socioeconomic data\purchasing_power_index.csv"
df.to_csv(file_to_save, index=True)

#### 4.7.2 Check save

In [ ]:
df_check = pd.read_csv(file_to_save, index_col=0)
df_check.head()

In [ ]:
df_check.shape == df.shape

In [ ]:
del df_check, file_to_save, df

### 5. Geolocation data

In [41]:
import pandas as pd
from pathlib import Path

file_path = Path("data\clean\Data_Engineer\Data_Engineer_15-04-2023.csv")
data = pd.read_csv(file_path, index_col=0, header=[0, 1])

In [31]:
import numpy as np
from geopy.geocoders import Nominatim

def show_number_of_jobs_per_country(
        data_input: pd.DataFrame, 
    ):

    def get_location(country, state, city):

        if country is np.nan:
            country = None

        if state is np.nan:
            state = None

        if city is np.nan:
            city = None

        if city == "Remote":

            return np.nan

        elif country or state or city:

            return ', '.join(
                    filter(None, [
                        country,
                        state,
                        city])
                )
        
        else:

            return np.nan
        
    def get_lat_long(address):

        if address is not np.nan:
            location = geolocator.geocode(address)
            if location:
                return (location.latitude, location.longitude)
            
        return (np.nan, np.nan)
    
    data_output = pd.DataFrame()

    data_output['Region'] = data_input['Job_details']['Region']
    data_output['Country'] = data_input['Job_details']['Country']
    data_output['State'] = data_input['Job_details']['State']
    data_output['City'] = data_input['Job_details']['City']

    data_output.drop_duplicates(inplace=True)
    data_output.dropna(subset=['City'], inplace=True)

    data_output['Location'] = data_input.apply(
            lambda row: get_location(
                row['Job_details']['Country'],
                row['Job_details']['State'],
                row['Job_details']['City'],
            ), 
            axis=1
        )
    
    geolocator = Nominatim(user_agent="my_app")
        
    data_output["latitude_longitude"] = data_output["Location"].apply(get_lat_long)

    data_output[["Latitude", "Longitude"]] = pd.DataFrame(
            data_output["latitude_longitude"].tolist(), index=data_output.index
        )

    data_output.drop(["latitude_longitude"], axis=1, inplace=True)

    return data_output

In [32]:

data_geolocation = show_number_of_jobs_per_country(data)

In [34]:
data_geolocation['City'].value_counts()

Remote                9
Heimarbeit            2
Cambridge             2
Melbourne             1
Boadilla del Monte    1
                     ..
Kassel                1
Heidelberg            1
Kleinostheim          1
DÃ¼sseldorf            1
Saint Louis           1
Name: City, Length: 558, dtype: int64

In [37]:
clean_df['City'].value_counts(dropna=False)

Heimarbeit            2
Cambridge             2
Melbourne             1
Boadilla del Monte    1
Madrid                1
                     ..
Kassel                1
Heidelberg            1
Kleinostheim          1
DÃ¼sseldorf            1
Saint Louis           1
Name: City, Length: 557, dtype: int64

In [38]:
clean_df['Latitude'].value_counts(dropna=False)

 NaN          7
 22.285039    2
 32.085300    2
-37.814218    1
 40.416705    1
             ..
 49.409358    1
 50.003804    1
 51.225402    1
 48.946756    1
 38.628028    1
Name: latitude, Length: 551, dtype: int64

In [55]:
clean_df[clean_df['latitude'].isna()]

,Region,Country,State,City,Location,latitude,longitude
76,Europe,Austria,NaN,Heimarbeit,"Austria, Heimarbeit",NaN,NaN
367,Europe,Denmark,NaN,Northern Jutland,"Denmark, Northern Jutland",NaN,NaN
493,Europe,France,NaN,TÃ©lÃ©travail,"France, TÃ©lÃ©travail",NaN,NaN
883,Europe,Greece,NaN,Heraklion Airport Terminal,"Greece, Heraklion Airport Terminal",NaN,NaN
1464,Europe,Italy,NaN,Telelavoro,"Italy, Telelavoro",NaN,NaN
1850,Europe,Portugal,NaN,Home office,"Portugal, Home office",NaN,NaN
2343,Europe,Spain,NaN,Trabajo en remoto,"Spain, Trabajo en remoto",NaN,NaN

In [57]:
selected_row = clean_df.loc[883]

selected_row['latitude'] = 35.341460
selected_row['longitude'] = 25.171464

clean_df.loc[883] = selected_row

C:\Users\karol\AppData\Local\Temp\ipykernel_20488\2908105528.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  selected_row['latitude'] = 35.341460
C:\Users\karol\AppData\Local\Temp\ipykernel_20488\2908105528.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  selected_row['longitude'] = 25.171464

In [58]:
clean_df[clean_df['latitude'].isna()]

,Region,Country,State,City,Location,latitude,longitude
76,Europe,Austria,NaN,Heimarbeit,"Austria, Heimarbeit",NaN,NaN
367,Europe,Denmark,NaN,Northern Jutland,"Denmark, Northern Jutland",NaN,NaN
493,Europe,France,NaN,TÃ©lÃ©travail,"France, TÃ©lÃ©travail",NaN,NaN
1464,Europe,Italy,NaN,Telelavoro,"Italy, Telelavoro",NaN,NaN
1850,Europe,Portugal,NaN,Home office,"Portugal, Home office",NaN,NaN
2343,Europe,Spain,NaN,Trabajo en remoto,"Spain, Trabajo en remoto",NaN,NaN

In [62]:
clean_df.to_csv("data\clean\_Socioeconomic data\geopositioning.csv", index=False)

In [63]:
del clean_df, data, data_geolocation, selected_row